diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРеализаций</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
&НаКлиенте
    Процедура СоздатьСписок(Команда)
     ДлительнаяОперация = НачатьВыполнениеНаСервере();
     ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
     ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
     ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
    КонецПроцедуры

    &НаСервере
    Функция НачатьВыполнениеНаСервере()
     ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
     Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьСписокНаСервере", 
      Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания);
    КонецФункции
                      
    &НаКлиенте
    Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт
     Если Результат = Неопределено Тогда
      Возврат;
  КонецЕсли;
     
   СписокРеализацийМассив = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
   ЗаполнитьСписокРеализаций(СписокРеализацийМассив);
     
КонецПроцедуры  

  	&НаКлиенте
	Процедура  ЗаполнитьСписокРеализаций(СписокРеализацийМассив);
		
		Объект.СписокРеализаций.Очистить(); 
				
		Для Каждого СписокРеализацияСтруктура Из СписокРеализацийМассив Цикл 
			
			НоваяСтрока = Объект.СписокРеализаций.Добавить();
			НоваяСтрока.Договор = СписокРеализацияСтруктура.Договор;       
			НоваяСтрока.Реализация = СписокРеализацияСтруктура.Реализация;
				
		КонецЦикла;
				
	КонецПроцедуры
